template_test/getlibsys.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:opacService">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:getLibSysCode soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <code xsi:type="xsd:string">{{name}}</code>
      </urn:getLibSysCode>
   </soapenv:Body>
</soapenv:Envelope>
